Revit 2026 API

# IFCDataAsInstance Method

---

Gets storage value as IFCAnyHandle when its PrimitiveType is instance.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAnyHandle AsInstance()
```
```vb
Public Function AsInstance As IFCAnyHandle
```
```cpp
public:
IFCAnyHandle^ AsInstance()
```
```fsharp
member AsInstance : unit -> IFCAnyHandle
```

#### Return Value

IFCAnyHandle The IFCAnyHandle.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not instance. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace